# tarea 2

In [5]:
import pandas as pd
import numpy as np

In [6]:
def ex1_concat_same_structure():
    """Ejercicio 1:
    Crea dos DataFrame que compartan la misma estructura de columnas (por ejemplo,
    'Nombre' y 'Edad'), con al menos 3 filas cada uno. Concaténalos verticalmente
    en un único DataFrame. Retorna el DataFrame resultante.
    """
    pass

In [106]:
def ex1_concat_same_structure():
    data = [['Ana', '23'], ['Monce', '20'], ['Nat','19']]
    df1 = pd.DataFrame(data, columns= ['Nombre','Edad'])
    df1

    data2 = [['Mariana', '19'], ['Valentina', '22'], ['Melisa','23']]
    df2 = pd.DataFrame(data2, columns= ['Nombre','Edad'])
    df2

    df_vertical = pd.concat([df1, df2], ignore_index=True)
    return df_vertical

In [108]:
ex1_concat_same_structure()

      Nombre Edad
0        Ana   23
1      Monce   20
2        Nat   19
3    Mariana   19
4  Valentina   22
5     Melisa   23

In [ ]:
def ex2_concat_with_month_column():
    """Ejercicio 2:
    Tienes un DataFrame con ventas de enero y otro con ventas de febrero (mismas columnas).
    Concaténalos en un solo DataFrame y añade una columna que indique el mes original
    de cada fila (por ejemplo: 'Enero' o 'Febrero'). Retorna el DataFrame resultante.
    """
    pass

In [431]:
def ex2_concat_with_month_column():
    data = np.round(np.random.uniform(5000, 20000, 7), 2)
    ventas_enero = pd.DataFrame({'Día':range (1,8), 'Venta': data})
    ventas_enero

    data = np.round(np.random.uniform(5000, 20000, 7), 2)
    ventas_feb = pd.DataFrame({'Día':range (1,8), 'Venta': data})
    ventas_feb

    ventas = pd.concat([ventas_enero, ventas_feb], ignore_index=True)
    ventas['Mes'] = ['Enero']*7 + ['Febrero']*7
    return ventas

In [432]:
ex2_concat_with_month_column()

    Día     Venta      Mes
0     1  19176.51    Enero
1     2  10837.75    Enero
2     3  12822.37    Enero
3     4   5871.44    Enero
4     5   9791.17    Enero
5     6   5627.54    Enero
6     7   9577.13    Enero
7     1  17512.38  Febrero
8     2   9130.49  Febrero
9     3  10371.20  Febrero
10    4  16208.98  Febrero
11    5  14461.13  Febrero
12    6   7329.77  Febrero
13    7  19388.29  Febrero

In [ ]:
def ex3_concat_diff_columns_fillna():
    """Ejercicio 3:
    Crea dos DataFrame que no tengan exactamente las mismas columnas (ej.: uno tiene
    'Producto' y 'Ventas', el otro 'Producto' y 'Descuento'). Concaténalos y asegura
    que los valores faltantes queden rellenados con 0. Retorna el DataFrame resultante.
    """
    pass

In [116]:
def ex3_concat_diff_columns_fillna():
    data = np.random.randint(0, 30, 5)
    ventas = pd.DataFrame({'Producto': ['cafe', 'pan', 'chocolate', 'te', 'pastel'] , 'Ventas': data})
    ventas

    descuento = pd.DataFrame({'Producto': ['cafe', 'pan', 'chocolate', 'te', 'pastel'] , 'Descuento': [10, 25, 10, 15, 25]})

    ventascon = pd.concat([ventas, descuento], ignore_index=True)

    return ventascon.fillna(value='0')

In [117]:
ex3_concat_diff_columns_fillna()

    Producto Ventas Descuento
0       cafe   16.0         0
1        pan   21.0         0
2  chocolate   14.0         0
3         te   20.0         0
4     pastel   13.0         0
5       cafe      0      10.0
6        pan      0      25.0
7  chocolate      0      10.0
8         te      0      15.0
9     pastel      0      25.0

In [ ]:
def ex4_concat_three_groups():
    """Ejercicio 4:
    Genera tres DataFrame pequeños (cada uno con, por ejemplo, 3 filas) que representen
    notas de distintos grupos de alumnos. Concaténalos verticalmente en un solo DataFrame
    que contenga todas las notas. Retorna el DataFrame resultante.
    """
    pass

In [119]:
def ex4_concat_three_groups():
    data = [['Ana', '9'], ['Monce', '9'], ['Xim','8.5']]
    df1 = pd.DataFrame(data, columns= ['Nombre','Calificación'])

    data2 = [['Rodrigo', '9.8'], ['Javi', '9'], ['Roy','8.9']]
    df2 = pd.DataFrame(data2, columns= ['Nombre','Calificación'])

    data3 = [['Pao', '8'], ['Pau', '9'], ['Meche','9.1']]
    df3 = pd.DataFrame(data3, columns= ['Nombre','Calificación'])

    calificaciones= pd.concat([df1, df2, df3], ignore_index=True)
    return calificaciones

In [120]:
ex4_concat_three_groups()

    Nombre Calificación
0      Ana            9
1    Monce            9
2      Xim          8.5
3  Rodrigo          9.8
4     Javi            9
5      Roy          8.9
6      Pao            8
7      Pau            9
8    Meche          9.1

In [ ]:
def ex5_remove_duplicates_preserve_order(lst):
    """Ejercicio 5:
    Dada una lista de enteros (o strings) que puede contener duplicados, devuelve una
    nueva lista sin duplicados preservando el orden original. No uses directamente set()
    para eliminar duplicados (escribe la lógica que preserve el orden). Retorna la nueva 
    lista sin duplicados.
    """
    pass

In [146]:
def ex5_remove_duplicates_preserve_order(lst):
    resultado = []

    for elem in lst:
        if elem not in resultado:
            resultado.append(elem)
    return resultado

In [149]:
lst = [8, 5, 3, 5, 1, 9, 8, 0]
ex5_remove_duplicates_preserve_order(lst)

[8, 5, 3, 1, 9, 0]

In [65]:
def ex6_sort_tuples_by_second_element(tuples_list):
    """Ejercicio 6:
    Dada una lista de tuplas, por ejemplo [("a", 3), ("b", 1), ("c", 2)], ordénala
    por el segundo elemento de cada tupla y devuelve la lista ordenada. Usa una función
    anónima si lo deseas. Retorna la lista ordenada.
    """
    pass

In [153]:
def ex6_sort_tuples_by_second_element(tuples_list):
    return sorted(tupla, key=lambda x: x[1])

In [154]:
ex6_sort_tuples_by_second_element([("a", 3), ("b", 1), ("c", 2)])

[('b', 1), ('c', 2), ('a', 3)]

In [ ]:
def ex7_first_n_multiples_of_7(n):
    """Ejercicio 7:
    Devuelve una lista con los primeros n múltiplos de 7 (por ejemplo, n=5 -> [7,14,21,28,35]).
    Retorna la lista generada.
    """
    pass

In [91]:
def ex7_first_n_multiples_of_7(n):
    multiplo = []
    for i in range (1, n + 1):
       multiplo.append(7 * i)
    return multiplo

In [92]:
print (ex7_first_n_multiples_of_7(5))

[7, 14, 21, 28, 35]

In [ ]:
def ex8_filter_palindromes(strings):
    """Ejercicio 8:
    Dada una lista de cadenas, devuelve sólo aquellas que son palíndromos (se leen igual
    al derecho y al revés). Retorna una lista con los palíndromos encontrados.
    """
    pass

In [164]:
def ex8_filter_palindromes(strings):
    palindromo = []
    for palabra in strings:
       if palabra == palabra[::-1]:
           palindromo.append(palabra)
    return palindromo

In [168]:
strings = ["ana", "libro", "somos", "gato", "oso"]
ex8_filter_palindromes(strings)

['ana', 'somos', 'oso']

In [ ]:
def ex9_set_intersection_and_difference(set_a, set_b):
    """Ejercicio 9:
    Dado dos conjuntos, devuelve su intersección y la diferencia (elementos de A que no
    están en B). Retorna una tupla (intersección, diferencia).
    """
    pass

In [176]:
def ex9_set_intersection_and_difference(set_a, set_b):
    interseccion =  set_a & set_b
    diferencia =  set_a - set_b
    return (interseccion, diferencia)

In [179]:
set_a = {3, 5, 6, 1}
set_b = {5, 8, 9, 0}

ex9_set_intersection_and_difference(set_a, set_b)

({5}, {1, 3, 6})

In [ ]:
def ex10_is_subset(set_a, set_b):
    """Ejercicio 10:
    Verifica si set_a es subconjunto de set_b. Devuelve True o False.
    """
    pass

In [180]:
def ex10_is_subset(set_a, set_b):
    subconjunto = set_a <= set_b
    return subconjunto

In [181]:
set_a = {3, 5}
set_b = {5, 8, 9, 3}

ex10_is_subset(set_a, set_b)

True

In [ ]:
def ex11_count_unique_elements(lst):
    """Ejercicio 11:
    Dada una lista, cuenta cuántos elementos únicos contiene (usa set para obtener el conteo).
    Retorna el número de elementos únicos.
    """
    pass

In [183]:
def ex11_count_unique_elements(lst):
    return len(set(lista))

In [185]:
lista = [1, 2, 3, 1, 1, 4, 8]
ex11_count_unique_elements(lst)

5

In [ ]:
def ex12_unique_words_from_phrases(phrases):
    """Ejercicio 12:
    Dada una lista de frases (strings), extrae y devuelve el conjunto de todas las palabras
    únicas que aparecen en todas las frases. Retorna un conjunto con las palabras únicas.
    """
    pass

In [207]:
def ex12_unique_words_from_phrases(phrases):
    palabrasunicas = set()

    for frase in phrases: 
        palabrasunicas.update(frase.split())
    
    return palabrasunicas

In [208]:
phrases = ["galletas de avena y zanahoria",
    "galletas de chispas",
    "panque de zanahoria"]

ex12_unique_words_from_phrases(phrases)

{'avena', 'chispas', 'de', 'galletas', 'panque', 'y', 'zanahoria'}

In [ ]:
def ex13_oldest_person(tuple_list):
    """Ejercicio 13:
    Recibe una lista de tuplas (nombre, edad). Devuelve la tupla de la persona con mayor edad.
    """
    pass

In [209]:
def ex13_oldest_person(tuple_list):
    return max(personas, key=lambda x: x[1])

In [211]:
personas = [("Ana", 23), ("Monce", 20), ("Nat", 19)]
ex13_oldest_person(personas)

('Ana', 23)

In [ ]:
def ex14_convert_list_of_lists_to_tuples(list_of_lists):
    """Ejercicio 14:
    Convierte una lista de listas en una lista de tuplas. Retorna la nueva lista de tuplas.
    """
    pass

In [213]:
def ex14_convert_list_of_lists_to_tuples(list_of_lists):
    listatupla = []
    for sublista in list_of_lists:
        listatupla.append(tuple(sublista))  
    return listatupla

In [214]:
list_of_lists = [[1, 2], [3, 4], [5, 6]]

ex14_convert_list_of_lists_to_tuples(list_of_lists)

[(1, 2), (3, 4), (5, 6)]

In [ ]:
def ex15_sum_of_tuple_abc(t):
    """Ejercicio 15:
    Recibe una tupla de tres números (a, b, c). Desempaquétala y devuelve la suma a+b+c. 
    Retorna un número entero o flotante.
    """
    pass

In [223]:
def ex15_sum_of_tuple_abc(t):
    a, b, c  = t
    return a + b + c

In [224]:
t = (2, 5, 7)
ex15_sum_of_tuple_abc(t)

14

In [ ]:
def ex16_sort_product_price(prod_price_list):
    """Ejercicio 16:
    Dada una lista de tuplas (producto, precio), ordénala por precio de menor a mayor.
    Retorna la lista ordenada.
    """
    pass

In [227]:
def ex16_sort_product_price(prod_price_list):
    return sorted(prod_price_list, key=lambda x: x[1])

In [228]:
prod_price_list = [('cafe', 25), ('pan', 18), ('chocolate', 30)]
ex16_sort_product_price(prod_price_list)

[('pan', 18), ('cafe', 25), ('chocolate', 30)]

In [ ]:
def ex17_char_frequency(s):
    """Ejercicio 17:
    Cuenta la frecuencia de cada carácter en una cadena usando un diccionario.
    Retorna un diccionario {carácter: frecuencia}.
    """
    pass

In [229]:
def ex17_char_frequency(s):
    frecuencia= {}

    for c in s:
        if c in frecuencia:
            frecuencia[c] += 1
        else:
            frecuencia[c] = 1
    return frecuencia

In [230]:
s = "halloween"
ex17_char_frequency(s)

{'h': 1, 'a': 1, 'l': 2, 'o': 1, 'w': 1, 'e': 2, 'n': 1}

In [ ]:
def ex18_best_student(grades_dict):
    """Ejercicio 18:
    Dado un diccionario {alumno: calificación}, devuelve al mejor estudiante.
    Retorna una tupla (nombre, calificación).
    """
    pass

In [235]:
def ex18_best_student(grades_dict):
    return max(grades_dict.items(), key=lambda x: x[1])

In [236]:
grades_dict = {'Rodrigo': 9.8, 'Javi': 9, 'Roy':8.9}
ex18_best_student(grades_dict)

('Rodrigo', 9.8)

In [ ]:
def ex19_invert_dictionary(d):
    """Ejercicio 19:
    Invierte un diccionario, intercambiando claves y valores.
    Retorna el diccionario invertido.
    """
    pass

In [237]:
def ex19_invert_dictionary(d):
    dinvertido = {}
    for clave, valor in d.items():
        dinvertido[valor] = clave
    return dinvertido

In [239]:
d = {'Rodrigo': 9.8, 'Javi': 9, 'Roy':8.9}
ex19_invert_dictionary(d)

{9.8: 'Rodrigo', 9: 'Javi', 8.9: 'Roy'}

In [ ]:
def ex20_merge_dicts_sum_values(d1, d2):
    """Ejercicio 20:
    Fusiona dos diccionarios sumando los valores de las claves que se repitan. 
    Devuelve el diccionario resultante.
    """
    pass

In [249]:
def ex20_merge_dicts_sum_values(d1, d2):
    fusion = d1.copy()
    for clave, valor in d2.items():
        if clave in fusion:
            fusion[clave] += valor
        else:
            fusion[clave] = valor
    return fusion

In [250]:
d1 = {"a": 2, "b": 3, "c": 1}
d2 = {"b": 4, "c": 2, "d": 5}

ex20_merge_dicts_sum_values(d1, d2)

{'a': 2, 'b': 7, 'c': 3, 'd': 5}

In [ ]:
def ex21_numpy_array_set_fifth():
    """Ejercicio 21:
    Crea un arreglo de NumPy de 10 ceros y cambia el quinto elemento (índice 4) a 1.
    Retorna el array resultante.
    """
    pass

In [258]:
def ex21_numpy_array_set_fifth():
    ceros = np.zeros(10)
    ceros [4] = 1
    return ceros

In [259]:
ex21_numpy_array_set_fifth()

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [ ]:
def ex22_numpy_matrix_3x3():
    """Ejercicio 22:
    Genera una matriz 3x3 con los valores del 0 al 8. 
    Retorna la matriz como array de NumPy.
    """
    pass

In [261]:
def ex22_numpy_matrix_3x3():
    matriz = np.array ([[0,5,8],
                    [3,4,5],
                    [1,8,9]])
    return matriz

In [262]:
ex22_numpy_matrix_3x3()

array([[0, 5, 8],
       [3, 4, 5],
       [1, 8, 9]])

In [ ]:
def ex23_numpy_statistics():
    """Ejercicio 23:
    Genera un array aleatorio de 20 enteros y calcula la media, mediana y desviación estándar.
    Retorna una tupla (media, mediana, desviación estándar).
    """
    pass

In [273]:
def ex23_numpy_statistics():
    aleat = np.random.randint(0, 38, size =20)

    media= np.mean(aleat)
    mediana = np.median(aleat)
    desviacion = round(np.std(aleat),2)

    return print(f"(Media: {media}, Mediana: {mediana}, Desviación estándar: {desviacion})")

In [274]:
ex23_numpy_statistics()

(Media: 23.3, Mediana: 23.0, Desviación estándar: 8.4)

In [ ]:
def ex24_numpy_clip_values(arr):
    """Ejercicio 24:
    Dado un array (o lista) de números, reemplaza todos los valores mayores que 10 por 10
    (es decir, limita/"clip" los valores máximos).
    Retorna el array modificado.
    """
    pass

In [278]:
def ex24_numpy_clip_values(arr):

    for n in range(len(arr)):
        if arr[n] > 10:
            arr[n] = 10
    return arr

In [280]:
arr = np.random.randint(0, 15, size =15)
ex24_numpy_clip_values(arr)

array([ 9,  5, 10, 10,  1,  6,  7,  0,  0, 10,  0,  3,  9, 10,  0],
      dtype=int32)

In [ ]:
def ex25_filter_rows_age_over_30():
    """Ejercicio 25:
    Crea un DataFrame con columnas 'Nombre', 'Edad' y 'Ciudad'.
    Filtra y retorna solo las filas con `Edad` > 30.
    """
    pass

In [293]:
def ex25_filter_rows_age_over_30():
    data = [['Ana', '33', 'Guanajuato'], 
            ['Monce', '19', 'Cuernavaca'], 
            ['Xim','31','Toluca']]
    
    df1 = pd.DataFrame(data, columns= ['Nombre','Edad','Ciudad'])
    df1['Edad'] = df1['Edad'].astype(int)

    df_f = df1 [df1 ['Edad'] > 30]
    return df_f

In [294]:
ex25_filter_rows_age_over_30()

  Nombre  Edad      Ciudad
0    Ana    33  Guanajuato
2    Xim    31      Toluca

In [ ]:
def ex26_load_dict_into_dataframe_and_sort():
    """Ejercicio 26:
    Carga un diccionario en un DataFrame (por ejemplo {'Nombre': [...], 'Puntaje': [...]})
    y ordénalo por la columna de puntaje de mayor a menor.
    Retorna el DataFrame ordenado.
    """
    pass

In [315]:
def ex26_load_dict_into_dataframe_and_sort():
    data = {'Nombre': ['Ana', 'Arely', 'Angeles', 'Alan'],
        'Puntaje': [85, 92, 78, 90]}
    
    df = pd.DataFrame(data)

    df_ordenado = df.sort_values(by='Puntaje', ascending=False)
    
    return df_ordenado

In [316]:
ex26_load_dict_into_dataframe_and_sort()

    Nombre  Puntaje
1    Arely       92
3     Alan       90
0      Ana       85
2  Angeles       78

In [ ]:
def ex27_groupby_mean_value():
    """Ejercicio 27:
    Dado un DataFrame con columnas 'Grupo' y 'Valor', calcula el promedio de 'Valor'
    por cada 'Grupo' usando groupby. 
    Retorna el DataFrame agrupado con promedios.
    """
    pass

In [356]:
def ex27_groupby_mean_value():
    data = {'Grupo': ['A', 'B', 'A', 'B', 'D', 'C', 'C', 'D'],
            'Valor': [85, 92, 78, 90, 99, 87, 91, 89]}
    
    df = pd.DataFrame(data)

    promedios = df.groupby('Grupo')['Valor'].mean()

    df ['promedios'] = promedios
    return df

In [357]:
ex27_groupby_mean_value()

  Grupo  Valor  promedios
0     A     85        NaN
1     B     92        NaN
2     A     78        NaN
3     B     90        NaN
4     D     99        NaN
5     C     87        NaN
6     C     91        NaN
7     D     89        NaN

In [ ]:
def ex28_most_sold_product_from_sales_df():
    """Ejercicio 28:
    Dado un DataFrame de ventas con columnas 'Producto' y 'Cantidad', determina cuál
    es el producto con la mayor suma total de 'Cantidad' (es decir, el más vendido).
    Retorna una tupla (Producto, Ventas).
    """
    pass

In [409]:
def ex28_most_sold_product_from_sales_df():
    data = np.random.randint(0, 30, 10)
    ventas = pd.DataFrame({'Producto': ['cafe', 'cafe', 'pan', 'pan', 'chocolate', 'pastel', 'te', 'pastel', 'chocolate', 'te'] , 'Cantidad': data})

    suma = ventas.groupby('Producto')['Cantidad'].sum()
    max_categoria = suma.idxmax() 
    max_valor = suma.max()  
    return (max_categoria, max_valor)

In [410]:
ex28_most_sold_product_from_sales_df()

('pan', np.int32(52))

In [ ]:
def ex29_map_lambda_cube(lst):
    """Ejercicio 29:
    Usa map junto con una función lambda para elevar al cubo cada número en una lista.
    Devuelve la lista resultante.
    """
    pass

In [384]:
def ex29_map_lambda_cube(lst):
    return list(map(lambda x: x** 3, lst))

In [385]:
lst = (2, 3, 1, 4)
ex29_map_lambda_cube(lst)

[8, 27, 1, 64]

In [ ]:
def ex30_filter_lambda_even(lst):
    """Ejercicio 30:
    Usa filter y una lambda para quedarte sólo con los números pares de una lista.
    Devuelve la lista filtrada.
    """
    pass

In [390]:
def ex30_filter_lambda_even(lst):
    return list(filter(lambda x: x % 2 == 0, lst))

In [391]:
lst = (2, 3, 1, 4, 23, 35, 64)
ex30_filter_lambda_even(lst)

[2, 4, 64]

In [413]:
def ex31_sort_list_of_dicts_by_key(lst, keyname):
    """Ejercicio 31:
    Dada una lista de diccionarios, ordénala por el valor asociado a 'keyname' usando
    sorted con una lambda. Devuelve la lista ordenada.
    """
    pass

In [414]:
def ex31_sort_list_of_dicts_by_key(lst, keyname):
    return sorted(lst, key=lambda x: x[keyname])

In [416]:
keyname = 'edad'
lst = [{'nombre': 'Ana', 'edad': 25},
    {'nombre': 'Luis', 'edad': 30},
    {'nombre': 'Mariana', 'edad': 20}]

ex31_sort_list_of_dicts_by_key(lst, keyname)

[{'nombre': 'Mariana', 'edad': 20},
 {'nombre': 'Ana', 'edad': 25},
 {'nombre': 'Luis', 'edad': 30}]

In [ ]:
def ex32_pandas_apply_lambda_uppercase(names_list):
    """Ejercicio 32:
    Crea un DataFrame con una columna 'Nombre' a partir de names_list y usa apply con
    una función lambda para crear una nueva columna con los nombres en mayúsculas.
    Devuelve el DataFrame modificado.
    """
    pass

In [426]:
def ex32_pandas_apply_lambda_uppercase(names_list): 
    df = pd.DataFrame({'Nombre': names_list})
    df['NombreM'] = df['Nombre'].apply(lambda x: x.upper())
    return df

In [428]:
names_list = ('Ana', 'Beatriz', 'Camila')
ex32_pandas_apply_lambda_uppercase(names_list)

    Nombre  NombreM
0      Ana      ANA
1  Beatriz  BEATRIZ
2   Camila   CAMILA